<template>
  <section class="portfolio">
    <div class="portfolio-wrap container">
      <BreadCrumbs :title="pageTitle"></BreadCrumbs>
      <h2 class="portfolio__title section-title">{{ pageTitle }}</h2>
      <CardList :card-data="cardList"></CardList>
      <button @click="seeMore()" class="btn portfolio__btn">
        <span></span>
        Показати більше
        <span></span>
      </button>
      <div class="portfolio-info">
        <p class="portfolio-info__text general-text">
          <strong>Дизайн інтер’єру</strong> – це, у першу чергу, відображення стилю життя. Предмети, які нас оточують, здатні розповісти набагато більше про пріоритети, погляди на життя й звички своїх господарів, аніж вони самі. Тому вибір дизайну інтер’єру, стилю й настрою, який буде панувати в цьому помешканні, важливий для комфорту, духовної гармонії й моральної рівноваги господаря будинку. Звичайно, не потрібно забувати про функціональність та ергономічність простору.
          <br />
          <br />
          Design Studio «SEDARTE» займається розробкою проектів інтер’єру  більше шести років.  Перевагу фахівці надають особистісним якостям замовника, на основі яких формується стилістика інтер’єру, адже в житловому просторі людина повинна відчувати себе невимушено й комфортно.
          <br />
          <br />
          І ніяких обмежень щодо вибору стилю. Ми підтримаємо будь-яку вашу пропозицію й втілимо її в життя! Адже кожному імпонує свій стиль в інтер’єрі, і ніякі модні тенденції не повинні на це впливати. Дизайн інтер’єру може бути оформлений у стилі хай-тек, поп-арт, кантрі, контемпорарі або шеббі-шик – усе залежить не тільки від спеціаліста, який розробляє проект, а й від замовника, адже тільки він знає, що подобається йому найбільше, якому стилю він надає перевагу в повсякденному житті і що робить його життя комфортнішим. Дизайнер отримує від замовника потрібну інформацію і, виходячи з цього, створює проект інтер’єру, який необхідний саме йому.
        </p>
        <h4 class="portfolio-info__subtitle">Що означає поняття «дизайн інтер’єру»?</h4>
        <p class="portfolio-info__text general-text">
          Дизайн інтер’єру – це комплекс рішень, який починається з вибору стилю інтер’єру й закінчується підбором відтінку вази для квітів. Увесь цей шлях дизайнер і замовник мають пройти разом, розуміючи й підтримуючи один одного, тоді результат перевищить усі ваші сподівання! Дизайнери Design Studio «SEDARTE» будують із замовниками не тільки ділові, а й дружні стосунки, котрі важливі для подальшого успішного співробітництва. Ми працюємо в такий спосіб, коли дизайнер і клієнт на час розробки та реалізації проекту стають єдиним цілим – командою! Саме така співпраця є носієм очікуваних позитивних результатів. З нашими дизайнерами завжди працювати легко, невимушено й весело, а розуміння досягається з півслова. Отож,  якщо ви хоча б раз звернулися до Design Studio «SEDARTE», то беззаперечно знайшли свого однодумця й неодмінно повернетеся ще не раз! Теплі взаємини всередині команди й душевна розмова з клієнтом – це ті пріоритети, які вирізняють Design Studio «SEDARTE» на ринку України й Києва зокрема. Індивідуальний підхід, прагнення до досконалості, якісне втілення омріяного, а також креативна складова, закладена в назві студії, – усе це відбивається в кожному проекті команди професіоналів і приносить бажані результати. Особистісний підхід дає можливість створювати щось унікальне й неповторне. Перфекціонізм допомагає реалізувати проект дизайну інтер’єру на найвищому рівні! Якісна робота – це домінанта будь-якої справи, а креативний підхід – гарантія того, що будь-яке, навіть банальне рішення, буде розроблено по-новому, ексклюзивно й оригінально.
          <br />
          <br />
          Співробітники студії підходять до будь-якого питання виважено й обдумано. Це може бути складне перепланування, для якого потрібний відповідний дозвіл; будматеріали, які з якоїсь причини були пошкоджені під час транспортування; чи нюанси при виконанні робіт підрядниками – наші фахівці справляться з будь-якими завданнями самостійно, не потурбувавши ані вас, ані ваших рідних. Досвід дає можливість стати мастром своєї справи – саме це ми в Design Studio «SEDARTE» найбільше цінуємо,  і це дозволяє нам ніколи не зупинятися на досягнутому й завжди крокувати тільки вперед!
        </p>
        <h4 class="portfolio-info__subtitle">Що важливо в дизайні інтер’єру?</h4>
        <p class="portfolio-info__text general-text">
          У дизайні інтер’єру важливо орієнтуватися в останніх сучасних тенденціях. Навіть якщо вам найбільше близький вікторіанський стиль, такі знання дають можливість створити новітній інтер’єр, який буде перегукуватися з характерними елементами тогочасного періоду. Сайт Design Studio «SEDARTE» у цьому вам допоможе! Інформаційний розділ «Стилі дизайну в інтер’єрі» дозволить вам розібратися в розмаїтті актуальних інтер’єрних рішень, а «Блог» зорієнтує в останніх тенденціях моди. Крім цього, на сайті можна познайомитися з командою, вивчити портфоліо фахівців, дізнатися про різні напрямки та стилі в дизайні інтер’єру, визначитися у своїх уподобаннях і подивитися міжнародні проекти, на які варто рівнятися. Фотознімки попередніх робіт дизайнерів Design Studio «SEDARTE» продемонструють професіоналізм нашої дружньої команди.
          <br />
          <br />
          Отже, якщо найближчим часом ви плануєте ремонт квартири чи будинку й цієї миті ще не обрали фірму, яка допоможе пережити його легко й навіть із задоволенням, фахівці студії Design Studio «SEDARTE» у цьому вам неодмінно допоможуть!
        </p>
        <h4 class="portfolio-info__subtitle">Вартість розробки дизайну</h4>
        <p class="portfolio-info__text general-text">
          Проекти здаються «під ключ» – від розробки ескізу майбутнього інтер’єру й до завершення всіх будівельних і декоративних робіт, підбору меблів і навіть виклику клірингового агентства. У послуги студії входить розробка ескізів, створення проекту дизайну інтер’єру, підбір матеріалів, контроль за ремонтно-будівельними роботами. Серед додаткових послуг Design Studio «SEDARTE»  пропонує індивідуальну розробку меблів, елементів декору, вітражів, мозаїчних панно, кованих виробів, художнього паркету, дизайну фасаду, вентиляції та системи кондиціонування. Відповідно до бажань і запитів клієнта вартість проекту може коливатися від 20 $ до 40 $ за квадратний метр. Замовити проект дизайну інтер’єру дуже просто. Для цього потрібно визначитися зі стилем, скласти список своїх побажань для майбутнього інтер’єру, зазначити інтер’єри, які вам найбільше імпонують, – і сміливо звертатися в Design Studio «SEDARTE». Усі контакти вказані на сайті. Для зручності ви також можете зв’язатися зі студією через соцмережі, скориставшись Instagram, Facebook або Pinterest.
          <br />
          <br />
          Обираючи дизайн інтер’єру, пам’ятайте: житловий простір – це не стільки останні тенденції й мода, а місце, у якому ви будете відчувати себе природньо, комфортно, невимушено,  немов це продовження вашого внутрішнього світу. Фахівці нашої студії дизайну інтер’єру це добре розуміють, тому, відмінно розбираючись в актуальних трендах, тут підберуть те, що підходить саме вам. Будьте впевнені, дизайнери Design Studio «SEDARTE» стануть надійними помічниками в здійсненні ваших найзаповітніших мрій і допоможуть досягти бажаного результату!
        </p>
      </div>
    </div>
  </section>
</template>

<script>
import BreadCrumbs from "@/components/BreadCrumbs.vue";
import CardList from "@/components/CardList.vue";

export default {
  name: "PortfolioPage",
  components: {
    BreadCrumbs,
    CardList
  },
  data() {
    return {
      pageTitle: "Дизайн інтер'єру",
      cardData: [
        {
          "img": require('../../assets/images/jpg/bucha210-min.jpg'),
          "title": "2021",
          "name": "Дом м. Буча, 210 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/malevycha123.jpg'),
          "title": "2021",
          "name": "ул. Казимира Малевича, 123 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/faina-town90-min.jpg'),
          "title": "2021",
          "name": "ЖК Файна Таун, 90 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/zk-time72-min.jpg'),
          "title": "2021",
          "name": "ЖК TIME, 72 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/zhulyany195-min.jpg'),
          "title": "2021",
          "name": "с. Жуляни, 195 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/zhk-rusanivska-gavan-68-min.jpg'),
          "title": "2021",
          "name": "ЖК Русановская гавань, 68 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/zk-jack-house-75.jpg'),
          "title": "2021",
          "name": "ЖК JACK HOUSE, 75 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/france-kvartal-106.jpg'),
          "title": "2021",
          "name": "ЖК Французский квартал, 106 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/komfort-taun-92.jpg'),
          "title": "2021",
          "name": "ЖК Комфорт Таун 92 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/varshhavski101.jpg'),
          "title": "2021",
          "name": "ЖК Варшавський квартал, 101 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/bortnichi215.jpg'),
          "title": "2021",
          "name": "Бортничи. ул Вишневая 9, 215 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/faina-town62-min.jpg'),
          "title": "2020",
          "name": "ЖК Файна Таун, 62 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/nova-angliya67-min.jpg'),
          "title": "2020",
          "name": "ЖК Новая Англия, 67 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/villaggo110.jpg'),
          "title": "2020",
          "name": "Котеджне Містечко (КМ) Villaggo, 110 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/faina-town74-min.jpg'),
          "title": "2020",
          "name": "ЖК Файна Таун, 74 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/kronapark86.jpg'),
          "title": "2020",
          "name": "ЖК Крона Парк м. Бровари, 86 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/bucha160.jpg'),
          "title": "2020",
          "name": "Будинок в м. Буча   160 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/obolonsky.jpg'),
          "title": "2020",
          "name": "ЖК ObolonSky 1-3 79 м.кв",
          "link": "/",
        },
      ],
      cardList: [
        {
          "img": require('../../assets/images/jpg/bucha210-min.jpg'),
          "title": "2021",
          "name": "Дом м. Буча, 210 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/malevycha123.jpg'),
          "title": "2021",
          "name": "ул. Казимира Малевича, 123 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/faina-town90-min.jpg'),
          "title": "2021",
          "name": "ЖК Файна Таун, 90 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/zk-time72-min.jpg'),
          "title": "2021",
          "name": "ЖК TIME, 72 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/zhulyany195-min.jpg'),
          "title": "2021",
          "name": "с. Жуляни, 195 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/zhk-rusanivska-gavan-68-min.jpg'),
          "title": "2021",
          "name": "ЖК Русановская гавань, 68 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/zk-jack-house-75.jpg'),
          "title": "2021",
          "name": "ЖК JACK HOUSE, 75 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/france-kvartal-106.jpg'),
          "title": "2021",
          "name": "ЖК Французский квартал, 106 м.кв.",
          "link": "/",
        },
        {
          "img": require('../../assets/images/jpg/komfort-taun-92.jpg'),
          "title": "2021",
          "name": "ЖК Комфорт Таун 92 м.кв.",
          "link": "/",
        },
      ],
    }
  },
  methods: {
    seeMore() {
      let count = 9;
      for (let i = 0; i < count; i++) {
        let cards = this.cardList.length;
        this.cardList.push(this.cardData[cards]);
      }
    }
  }
}
</script>

<style lang="scss">
@import "../../assets/styles/pages/portfolio-page/portfolio-page";
</style>
